Infineon/AURIX_code_examples/code_examples/iLLD_TC37x_ADS_SCR_Blinky_LED_LK_1/SCR/Libraries/registers.h
/**********************************************************************************************************************
 * \file registers.h
 * \copyright Copyright (C) Infineon Technologies AG 2019
 *
 * Use of this file is subject to the terms of use agreed between (i) you or the company in which ordinary course of
 * business you are acting and (ii) Infineon Technologies AG or its licensees. If and as long as no such terms of use
 * are agreed, use of this file is subject to following:
 *
 * Boost Software License - Version 1.0 - August 17th, 2003
 *
 * Permission is hereby granted, free of charge, to any person or organization obtaining a copy of the software and
 * accompanying documentation covered by this license (the "Software") to use, reproduce, display, distribute, execute,
 * and transmit the Software, and to prepare derivative works of the Software, and to permit third-parties to whom the
 * Software is furnished to do so, all subject to the following:
 *
 * The copyright notices in the Software and this entire statement, including the above license grant, this restriction
 * and the following disclaimer, must be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are solely in the form of
 * machine-executable object code generated by a source language processor.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE
 * WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT SHALL THE
 * COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN
 * CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS
 * IN THE SOFTWARE.
 *********************************************************************************************************************/
#ifndef REGISTERS_H
#define REGISTERS_H

/* NVM */
#define ADDR_NVM_STATUS1                0xe1    /* RMAP=0, PAGE= x - NVM register */
#define ADDR_NVM_STATUS2                0xe2    /* RMAP=0, PAGE= x - NVM register */
#define ADDR_NVM_ADDRP                  0xe3    /* RMAP=0, PAGE= x - NVM register */
#define ADDR_NVM_ADDRS                  0xe4    /* RMAP=0, PAGE= x - NVM register */
#define ADDR_NVM_CTRL                   0xe5    /* RMAP=0, PAGE= x - NVM register */
#define ADDR_NVM_MODE                   0xe6    /* RMAP=0, PAGE= x - NVM register */
#define ADDR_NVM_MAP1                   0xe7    /* RMAP=0, PAGE= x - NVM register */
#define ADDR_NVM_MAP2                   0xe9    /* RMAP=0, PAGE= x - NVM register */
#define ADDR_NVM_BRNG                   0xea    /* RMAP=0, PAGE= x - NVM register */
#define ADDR_NVM_PROT                   0xeb    /* RMAP=0, PAGE= x - NVM register */
#define ADDR_NVM_SFRSEL                 0xec    /* RMAP=0, PAGE= x - NVM register */
#define ADDR_NVM_SFRDAT                 0xed    /* RMAP=0, PAGE= x - NVM register */

/* SCR */
#define ADDR_SCR_DAPISC                 0x11    /* RMAP=x, PAGE= x - DAP Initialization, Status and Control Register */
#define ADDR_SCR_P00_OUT                0x90    /* RMAP=0, PAGE= 0 - Port P00 Output Register */
#define ADDR_SCR_P00_IN                 0x91    /* RMAP=0, PAGE= 0 - Port P00 Input Register */
#define ADDR_SCR_P00_OMSR               0x92    /* RMAP=0, PAGE= 0 - Port P00 Output Modification Set Register */
#define ADDR_SCR_P00_OMCR               0x93    /* RMAP=0, PAGE= 0 - Port P00 Output Modification Clear Register */
#define ADDR_SCR_P00_OMTR               0x94    /* RMAP=0, PAGE= 0 - Port P00 Output Modification Toggle Register */
#define ADDR_SCR_P01_OUT                0x98    /* RMAP=0, PAGE= 0 - Port P01 Output Register */
#define ADDR_SCR_P01_IN                 0x99    /* RMAP=0, PAGE= 0 - Port P01 Input Register */
#define ADDR_SCR_P01_OMSR               0x9a    /* RMAP=0, PAGE= 0 - Port P01 Output Modification Set Register */
#define ADDR_SCR_P01_OMCR               0x9b    /* RMAP=0, PAGE= 0 - Port P01 Output Modification Clear Register */
#define ADDR_SCR_P01_OMTR               0x9c    /* RMAP=0, PAGE= 0 - Port P01 Output Modification Toggle Register */
#define ADDR_SCR_WCAN_CFG               0xb0    /* RMAP=0, PAGE= 0 - Wake-Up CAN Configuration Register */
#define ADDR_SCR_WCAN_INTMRSLT          0xb1    /* RMAP=0, PAGE= 0 - Wake-Up CAN Interrupt Mask Register */
#define ADDR_SCR_WCAN_CDR_CTRL          0xb2    /* RMAP=0, PAGE= 0 - CDR Control Register */
#define ADDR_SCR_WCAN_CDR_UPPER_CTRL    0xb3    /* RMAP=0, PAGE= 0 - CDR Upper Limit Control Register */
#define ADDR_SCR_WCAN_CDR_LOWER_CTRL    0xb4    /* RMAP=0, PAGE= 0 - CDR Lower Limit Control Register */
#define ADDR_SCR_WCAN_CDR_MEAS_HIGH     0xb5    /* RMAP=0, PAGE= 0 - CDR Measured High Register */
#define ADDR_SCR_WCAN_CDR_MEAS_LOW      0xb6    /* RMAP=0, PAGE= 0 - CDR Measured Low Register */
#define ADDR_SCR_WCAN_FD_CTRL           0xb7    /* RMAP=0, PAGE= 0 - CAN FD Control Register */
#define ADDR_SCR_T2_CON                 0xc0    /* RMAP=0, PAGE= 0 - Timer 2 Control Register */
#define ADDR_SCR_T2_MOD                 0xc1    /* RMAP=0, PAGE= 0 - Timer 2 Mode Register */
#define ADDR_SCR_T2_RC2L                0xc2    /* RMAP=0, PAGE= 0 - Timer 2 Reload/Capture Register, Low Byte */
#define ADDR_SCR_T2_RC2H                0xc3    /* RMAP=0, PAGE= 0 - Timer 2 Reload/Capture Register, High Byte */
#define ADDR_SCR_T2_T2L                 0xc4    /* RMAP=0, PAGE= 0 - Timer 2, Low Byte */
#define ADDR_SCR_T2_T2H                 0xc5    /* RMAP=0, PAGE= 0 - Timer 2, High Byte */
#define ADDR_SCR_T2_CON1                0xc6    /* RMAP=0, PAGE= 0 - Timer 2 Control Register 1 */
#define ADDR_SCR_IRCON0                 0xf2    /* RMAP=0, PAGE= 0 - Interrupt Request Register 0 */
#define ADDR_SCR_IRCON1                 0xf3    /* RMAP=0, PAGE= 0 - Interrupt Request Register 1 */
#define ADDR_SCR_IRCON2                 0xf4    /* RMAP=0, PAGE= 0 - Interrupt Request Register 2 */
#define ADDR_SCR_SCRINTEXCHG            0xf5    /* RMAP=0, PAGE= 0 - SCR Interrupt Data Exchange Register */
#define ADDR_SCR_TCINTEXCHG             0xf6    /* RMAP=0, PAGE= 0 - TriCore Interrupt Data Exchange Register */
#define ADDR_SCR_SCU_RSTST              0xf7    /* RMAP=0, PAGE= 0 - SCR Reset Status Register */
#define ADDR_SCR_SCU_MRSTST             0xf8    /* RMAP=0, PAGE= 0 - Main Reset Status Register */
#define ADDR_SCR_SCU_SR                 0xf9    /* RMAP=0, PAGE= 0 - SCU Status Register */
#define ADDR_SCR_ADCOMP_RES             0xfa    /* RMAP=0, PAGE= 0 - ADCOMP Result Register */
#define ADDR_SCR_ADCOMP_CON             0xfb    /* RMAP=0, PAGE= 0 - ADCOMP Control Register */
#define ADDR_SCR_WDT_CON                0x81    /* RMAP=0, PAGE= X - Watchdog Timer Control Register */
#define ADDR_SCR_WDT_REL                0x82    /* RMAP=0, PAGE= X - Watchdog Timer Reload Register */
#define ADDR_SCR_WDT_WINB               0x83    /* RMAP=0, PAGE= X - Watchdog Window-Boundary Register */
#define ADDR_SCR_WDT_L                  0x84    /* RMAP=0, PAGE= X - Watchdog Timer Low Byte */
#define ADDR_SCR_WDT_H                  0x85    /* RMAP=0, PAGE= X - Watchdog Timer High Byte */
#define ADDR_SCR_SSC_CONOL              0x89    /* RMAP=0, PAGE= X - Control Register Low [Operation Mode] */
#define ADDR_SCR_SSC_CONPL              0x89    /* RMAP=0, PAGE= X - Control Register Low [Programming Mode] */
#define ADDR_SCR_SSC_CONPH              0x8a    /* RMAP=0, PAGE= X - Control Register High [Programming Mode] */
#define ADDR_SCR_SSC_CONOH              0x8a    /* RMAP=0, PAGE= X - Control Register High [Operation Mode] */
#define ADDR_SCR_SSC_TBL                0x8b    /* RMAP=0, PAGE= X - Transmitter Buffer Register */
#define ADDR_SCR_SSC_RBL                0x8c    /* RMAP=0, PAGE= X - Receiver Buffer Register */
#define ADDR_SCR_SSC_BRL                0x8d    /* RMAP=0, PAGE= X - Baud Rate Timer Reload Register Low */
#define ADDR_SCR_SSC_BRH                0x8e    /* RMAP=0, PAGE= X - Baud Rate Timer Reload Register High */
#define ADDR_SCR_IO_PAGE                0x8f    /* RMAP=0, PAGE= X - Page Register for Port SFRs */
#define ADDR_SCR_WCAN_PAGE              0xb8    /* RMAP=0, PAGE= X - Page Register for WCAN */
#define ADDR_SCR_UART_SCON              0xb9    /* RMAP=0, PAGE= X - Serial Channel Control Register */
#define ADDR_SCR_UART_SBUF              0xba    /* RMAP=0, PAGE= X - Serial Data Buffer */
#define ADDR_SCR_UART_BGL               0xbc    /* RMAP=0, PAGE= X - Baudrate Timer/Reload Register, Low Byte */
#define ADDR_SCR_UART_BCON              0xbd    /* RMAP=0, PAGE= X - Baudrate Control Register */
#define ADDR_SCR_UART_LINST             0xbe    /* RMAP=0, PAGE= X - LIN Status Register */
#define ADDR_SCR_UART_BGH               0xbf    /* RMAP=0, PAGE= X - Baudrate Timer/Reload Register, High Byte */
#define ADDR_SCR_T2CCU_PAGE             0xc7    /* RMAP=0, PAGE= X - Page Register for T2CCU */
#define ADDR_SCR_RTC_CON                0xe1    /* RMAP=0, PAGE= X - Real-Time Clock Control Register */
#define ADDR_SCR_RTC_CNT0               0xe2    /* RMAP=0, PAGE= X - Count Clock Register 0 */
#define ADDR_SCR_RTC_CNT1               0xe3    /* RMAP=0, PAGE= X - Count Clock Register 1 */
#define ADDR_SCR_RTC_CNT2               0xe4    /* RMAP=0, PAGE= X - Count Clock Register 2 */
#define ADDR_SCR_RTC_CNT3               0xe5    /* RMAP=0, PAGE= X - Count Clock Register 3 */
#define ADDR_SCR_RTC_CR0                0xe6    /* RMAP=0, PAGE= X - Real-Time Clock Compare/Capture Register 0 */
#define ADDR_SCR_RTC_CR1                0xe7    /* RMAP=0, PAGE= X - Real-Time Clock Compare/Capture Register 1 */
#define ADDR_SCR_RTC_CR2                0xe8    /* RMAP=0, PAGE= X - Real-Time Clock Compare/Capture Register 2 */
#define ADDR_SCR_RTC_CR3                0xe9    /* RMAP=0, PAGE= X - Real-Time Clock Compare/Capture Register 3 */
#define ADDR_SCR_SCU_PAGE               0xf1    /* RMAP=0, PAGE= X - Page Register for SFRs */
#define ADDR_SCR_DBG_MMCR               0xf1    /* RMAP=1, PAGE= X - Monitor Mode Control Register */
#define ADDR_SCR_DBG_MMCR2              0xf2    /* RMAP=1, PAGE= X - Monitor Mode Control Register 2 */
#define ADDR_SCR_DBG_MMSR               0xf3    /* RMAP=1, PAGE= X - Monitor Mode Status Register */
#define ADDR_SCR_DBG_MMBPCR             0xf4    /* RMAP=1, PAGE= X - BreakPoints Control Register */
#define ADDR_SCR_DBG_MMICR              0xf5    /* RMAP=1, PAGE= X - Monitor Mode Interrupt Control Register */
#define ADDR_SCR_DBG_MMDR               0xf6    /* RMAP=1, PAGE= X - Monitor Mode Data Register - Receive */
#define ADDR_SCR_DBG_HWBPSR             0xf7    /* RMAP=1, PAGE= X - Hardware Breakpoints Select Register */
#define ADDR_SCR_DBG_HWBPDR             0xf8    /* RMAP=1, PAGE= X - Hardware Breakpoints Data Register */
#define ADDR_SCR_DBG_MMWR1              0xf9    /* RMAP=1, PAGE= X - Monitor Work Register 1 */
#define ADDR_SCR_DBG_MMWR2              0xfa    /* RMAP=1, PAGE= X - Monitor Work Register 2 */
#define ADDR_SCR_PASSWD                 0x86    /* RMAP=X, PAGE= X - Password Register */
#define ADDR_SCR_XADDRH                 0x87    /* RMAP=X, PAGE= X - On-Chip XRAM Address Higher Order */
#define ADDR_SCR_SYSCON0                0x88    /* RMAP=X, PAGE= X - System Control Register 0 */
#define ADDR_SCR_T01_TCON               0xc9    /* RMAP=X, PAGE= X - Timer 0/1 Control Register */
#define ADDR_SCR_T01_TMOD               0xca    /* RMAP=X, PAGE= X - Timer Mode Register */
#define ADDR_SCR_T01_TL0                0xcb    /* RMAP=X, PAGE= X - Timer 0 Low Byte */
#define ADDR_SCR_T01_TL1                0xcc    /* RMAP=X, PAGE= X - Timer 1 Low Byte */
#define ADDR_SCR_T01_TH0                0xcd    /* RMAP=X, PAGE= X - Timer 0 High Byte */
#define ADDR_SCR_T01_TH1                0xce    /* RMAP=X, PAGE= X - Timer 1 High Byte */
#define ADDR_SCR_PSW                    0xd0    /* RMAP=X, PAGE= X - Program Status Word Register */
#define ADDR_SCR_IEN1                   0xd1    /* RMAP=X, PAGE= X - Interrupt Enable Register 1 */
#define ADDR_SCR_IPH                    0xd2    /* RMAP=X, PAGE= X - Interrupt Priority High Register */
#define ADDR_SCR_IPH1                   0xd3    /* RMAP=X, PAGE= X - Interrupt Priority 1 High Register */
#define ADDR_SCR_SP                     0xd4    /* RMAP=X, PAGE= X - Stack Pointer */
#define ADDR_SCR_DPL                    0xd5    /* RMAP=X, PAGE= X - Data Pointer Low Byte */
#define ADDR_SCR_DPH                    0xd6    /* RMAP=X, PAGE= X - Data Pointer High Byte */
#define ADDR_SCR_EO                     0xd7    /* RMAP=X, PAGE= X - Extended Operation Register */
#define ADDR_SCR_IEN0                   0xd8    /* RMAP=X, PAGE= X - Interrupt Enable Register 0 */
#define ADDR_SCR_PCON                   0xd9    /* RMAP=X, PAGE= X - Power Control Register */
#define ADDR_SCR_B                      0xda    /* RMAP=X, PAGE= X - B Register */
#define ADDR_SCR_IP1                    0xdb    /* RMAP=X, PAGE= X - Interrupt Priority 1 Register */
#define ADDR_SCR_IP                     0xdc    /* RMAP=X, PAGE= X - Interrupt Priority Register */
#define ADDR_SCR_ACC                    0xe0    /* RMAP=X, PAGE= X - Accumulator */
#define ADDR_SCR_P00_IOCR0              0x90    /* RMAP=0, PAGE= 1 - Port P00 Input/Output Control Register 0 */
#define ADDR_SCR_P00_IOCR1              0x91    /* RMAP=0, PAGE= 1 - Port P00 Input/Output Control Register 1 */
#define ADDR_SCR_P00_IOCR2              0x92    /* RMAP=0, PAGE= 1 - Port P00 Input/Output Control Register 2 */
#define ADDR_SCR_P00_IOCR3              0x93    /* RMAP=0, PAGE= 1 - Port P00 Input/Output Control Register 3 */
#define ADDR_SCR_P00_IOCR4              0x94    /* RMAP=0, PAGE= 1 - Port P00 Input/Output Control Register 4 */
#define ADDR_SCR_P00_IOCR5              0x95    /* RMAP=0, PAGE= 1 - Port P00 Input/Output Control Register 5 */
#define ADDR_SCR_P00_IOCR6              0x96    /* RMAP=0, PAGE= 1 - Port P00 Input/Output Control Register 6 */
#define ADDR_SCR_P00_IOCR7              0x97    /* RMAP=0, PAGE= 1 - Port P00 Input/Output Control Register 7 */
#define ADDR_SCR_P01_IOCR0              0x98    /* RMAP=0, PAGE= 1 - Port P01 Input/Output Control Register 0 */
#define ADDR_SCR_P01_IOCR1              0x99    /* RMAP=0, PAGE= 1 - Port P01 Input/Output Control Register 1 */
#define ADDR_SCR_P01_IOCR2              0x9a    /* RMAP=0, PAGE= 1 - Port P01 Input/Output Control Register 2 */
#define ADDR_SCR_P01_IOCR3              0x9b    /* RMAP=0, PAGE= 1 - Port P01 Input/Output Control Register 3 */
#define ADDR_SCR_P01_IOCR4              0x9c    /* RMAP=0, PAGE= 1 - Port P01 Input/Output Control Register 4 */
#define ADDR_SCR_P01_IOCR5              0x9d    /* RMAP=0, PAGE= 1 - Port P01 Input/Output Control Register 5 */
#define ADDR_SCR_P01_IOCR6              0x9e    /* RMAP=0, PAGE= 1 - Port P01 Input/Output Control Register 6 */
#define ADDR_SCR_P01_IOCR7              0x9f    /* RMAP=0, PAGE= 1 - Port P01 Input/Output Control Register 7 */
#define ADDR_SCR_WCAN_INTESTAT0         0xb0    /* RMAP=0, PAGE= 1 - WCAN Interrupt and Event Status Register 0 */
#define ADDR_SCR_WCAN_INTESTAT1         0xb1    /* RMAP=0, PAGE= 1 - WCAN Interrupt and Event Status Register 1 */
#define ADDR_SCR_WCAN_FRMERRCNT         0xb2    /* RMAP=0, PAGE= 1 - WCAN Error Counter Register */
#define ADDR_SCR_WCAN_INTESCLR0         0xb3    /* RMAP=0, PAGE= 1 - WCAN Interrupt and Event Status Clear Register 0 */
#define ADDR_SCR_WCAN_INTESCLR1         0xb4    /* RMAP=0, PAGE= 1 - WCAN Interrupt and Event Status Clear Register 1 */
#define ADDR_SCR_WCAN_BTL1_CTRL         0xb5    /* RMAP=0, PAGE= 1 - Bit Timing Logic 1 Control Register */
#define ADDR_SCR_WCAN_BTL2_CTRL         0xb6    /* RMAP=0, PAGE= 1 - Bit Timing Logic 2 Control Register */
#define ADDR_SCR_WCAN_DLC_CTRL          0xb7    /* RMAP=0, PAGE= 1 - Message Data Length Code Control Register */
#define ADDR_SCR_T2CCU_CCEN             0xc0    /* RMAP=0, PAGE= 1 - T2CCU Capture/Compare Enable Register */
#define ADDR_SCR_T2CCU_CCTBSEL          0xc1    /* RMAP=0, PAGE= 1 - T2CCU Capture/Compare Time Base Select Register */
#define ADDR_SCR_T2CCU_CCTRELL          0xc2    /* RMAP=0, PAGE= 1 - T2CCU Capture/Compare Timer Reload Register Low */
#define ADDR_SCR_T2CCU_CCTRELH          0xc3    /* RMAP=0, PAGE= 1 - T2CCU Capture/Compare Timer Reload Register High*/
#define ADDR_SCR_T2CCU_CCTL             0xc4    /* RMAP=0, PAGE= 1 - T2CCU Capture/Compare Timer Register Low */
#define ADDR_SCR_T2CCU_CCTH             0xc5    /* RMAP=0, PAGE= 1 - T2CCU Capture/Compare Timer Register High */
#define ADDR_SCR_T2CCU_CCTCON           0xc6    /* RMAP=0, PAGE= 1 - T2CCU Capture/Compare Timer Control Register */
#define ADDR_SCR_NMISR                  0xf2    /* RMAP=0, PAGE= 1 - NMI Status Register */
#define ADDR_SCR_NMICON                 0xf3    /* RMAP=0, PAGE= 1 - NMI Control Register */
#define ADDR_SCR_EXICON0                0xf4    /* RMAP=0, PAGE= 1 - External Interrupt Control Register 0 */
#define ADDR_SCR_EXICON1                0xf5    /* RMAP=0, PAGE= 1 - External Interrupt Control Register 1 */
#define ADDR_SCR_EXICON2                0xf6    /* RMAP=0, PAGE= 1 - External Interrupt Control Register 2 */
#define ADDR_SCR_EXICON3                0xf7    /* RMAP=0, PAGE= 1 - External Interrupt Control Register 3 */
#define ADDR_SCR_SCU_MODIEN             0xf8    /* RMAP=0, PAGE= 1 - Peripheral Interrupt Enable Register */
#define ADDR_SCR_SCU_RSTCON             0xf9    /* RMAP=0, PAGE= 1 - Reset Control Register */
#define ADDR_SCR_SCU_CMCON              0xfa    /* RMAP=0, PAGE= 1 - Clock Control Register */
#define ADDR_SCR_SCU_PMCON1             0xfb    /* RMAP=0, PAGE= 1 - Peripheral Management Control Register 1 */
#define ADDR_SCR_SCU_STDBYWKP           0xfc    /* RMAP=0, PAGE= 1 - Standby Mode Wake-Up Register */
#define ADDR_SCR_EVRADCSTAT0            0xfd    /* RMAP=0, PAGE= 1 - EVR ADC Status Register 0 */
#define ADDR_SCR_EVRADCSTAT1            0xfe    /* RMAP=0, PAGE= 1 - EVR ADC Status Register 1 */
#define ADDR_SCR_EVRADCSTAT2            0xff    /* RMAP=0, PAGE= 1 - EVR ADC Status Register 2 */
#define ADDR_SCR_P00_PDR0               0x90    /* RMAP=0, PAGE= 2 - Port P00 Pad Driver Mode 0 Register */
#define ADDR_SCR_P00_PDR2               0x91    /* RMAP=0, PAGE= 2 - Port P00 Pad Driver Mode 2 Register */
#define ADDR_SCR_P00_PDR4               0x92    /* RMAP=0, PAGE= 2 - Port P00 Pad Driver Mode 4 Register */
#define ADDR_SCR_P00_PDR6               0x93    /* RMAP=0, PAGE= 2 - Port P00 Pad Driver Mode 6 Register */
#define ADDR_SCR_P00_PDISC              0x95    /* RMAP=0, PAGE= 2 - Port P00 Pin Function Decision Control Register */
#define ADDR_SCR_P01_PDR0               0x98    /* RMAP=0, PAGE= 2 - Port P01 Pad Driver Mode 0 Register */
#define ADDR_SCR_P01_PDR2               0x99    /* RMAP=0, PAGE= 2 - Port P01 Pad Driver Mode 2 Register */
#define ADDR_SCR_P01_PDR4               0x9a    /* RMAP=0, PAGE= 2 - Port P01 Pad Driver Mode 4 Register */
#define ADDR_SCR_P01_PDR6               0x9b    /* RMAP=0, PAGE= 2 - Port P01 Pad Driver Mode 6 Register */
#define ADDR_SCR_P01_PDISC              0x9d    /* RMAP=0, PAGE= 2 - Port P01 Pin Function Decision Control Register */
#define ADDR_SCR_WCAN_ID0_CTRL          0xb0    /* RMAP=0, PAGE= 2 - Message Identifier Control Register 0 */
#define ADDR_SCR_WCAN_ID1_CTRL          0xb1    /* RMAP=0, PAGE= 2 - Message Identifier Control Register 1 */
#define ADDR_SCR_WCAN_ID2_CTRL          0xb2    /* RMAP=0, PAGE= 2 - Message Identifier Control Register 2 */
#define ADDR_SCR_WCAN_ID3_CTRL          0xb3    /* RMAP=0, PAGE= 2 - Message Identifier Control Register 3 */
#define ADDR_SCR_WCAN_MASK_ID0_CTRL     0xb4    /* RMAP=0, PAGE= 2 - Message Identifier Mask Register 0 */
#define ADDR_SCR_WCAN_MASK_ID1_CTRL     0xb5    /* RMAP=0, PAGE= 2 - Message Identifier Mask Register 1 */
#define ADDR_SCR_WCAN_MASK_ID2_CTRL     0xb6    /* RMAP=0, PAGE= 2 - Message Identifier Mask Register 2 */
#define ADDR_SCR_WCAN_MASK_ID3_CTRL     0xb7    /* RMAP=0, PAGE= 2 - Message Identifier Mask Register 3 */
#define ADDR_SCR_T2CCU_COSHDW           0xc0    /* RMAP=0, PAGE= 2 - T2CCU Compare Shadow Register */
#define ADDR_SCR_T2CCU_CC0L             0xc1    /* RMAP=0, PAGE= 2 - T2CCU Capture/Compare Register 0 Low */
#define ADDR_SCR_T2CCU_CC1L             0xc2    /* RMAP=0, PAGE= 2 - T2CCU Capture/Compare Register 1 Low */
#define ADDR_SCR_T2CCU_CC2L             0xc3    /* RMAP=0, PAGE= 2 - T2CCU Capture/Compare Register 2 Low */
#define ADDR_SCR_T2CCU_CC0H             0xc4    /* RMAP=0, PAGE= 2 - T2CCU Capture/Compare Register 0 High */
#define ADDR_SCR_T2CCU_CC1H             0xc5    /* RMAP=0, PAGE= 2 - T2CCU Capture/Compare Register 1 High */
#define ADDR_SCR_T2CCU_CC2H             0xc6    /* RMAP=0, PAGE= 2 - T2CCU Capture/Compare Register 2 High */
#define ADDR_SCR_MODPISEL0              0xf2    /* RMAP=0, PAGE= 2 - Peripheral Input Select Register 0 */
#define ADDR_SCR_MODPISEL1              0xf3    /* RMAP=0, PAGE= 2 - Peripheral Input Select Register 1 */
#define ADDR_SCR_MODPISEL2              0xf4    /* RMAP=0, PAGE= 2 - Peripheral Input Select Register 2 */
#define ADDR_SCR_MODPISEL3              0xf5    /* RMAP=0, PAGE= 2 - Peripheral Input Select Register 3 */
#define ADDR_SCR_MODPISEL4              0xf6    /* RMAP=0, PAGE= 2 - Peripheral Input Select Register 4 */
#define ADDR_SCR_MODPISEL5              0xf7    /* RMAP=0, PAGE= 2 - Peripheral Input Select Register 5 */
#define ADDR_SCR_SCR_HWCFG              0xf8    /* RMAP=0, PAGE= 2 - Hardware Configuration Register */
#define ADDR_SCR_DBG_MODSUSP            0xf9    /* RMAP=0, PAGE= 2 - Module Suspend Control Register */
#define ADDR_SCR_WCAN_DATA0_CTRL        0xb0    /* RMAP=0, PAGE= 3 - DATA0 Control Register */
#define ADDR_SCR_WCAN_DATA1_CTRL        0xb1    /* RMAP=0, PAGE= 3 - DATA1 Control Register */
#define ADDR_SCR_WCAN_DATA2_CTRL        0xb2    /* RMAP=0, PAGE= 3 - DATA2 Control Register */
#define ADDR_SCR_WCAN_DATA3_CTRL        0xb3    /* RMAP=0, PAGE= 3 - DATA3 Control Register */
#define ADDR_SCR_WCAN_DATA4_CTRL        0xb4    /* RMAP=0, PAGE= 3 - DATA4 Control Register */
#define ADDR_SCR_WCAN_DATA5_CTRL        0xb5    /* RMAP=0, PAGE= 3 - DATA5 Control Register */
#define ADDR_SCR_WCAN_DATA6_CTRL        0xb6    /* RMAP=0, PAGE= 3 - DATA6 Control Register */
#define ADDR_SCR_WCAN_DATA7_CTRL        0xb7    /* RMAP=0, PAGE= 3 - DATA7 Control Register */
#define ADDR_SCR_T2CCU_COCON            0xc0    /* RMAP=0, PAGE= 3 - T2CCU Compare Control Register */
#define ADDR_SCR_T2CCU_CC3L             0xc1    /* RMAP=0, PAGE= 3 - T2CCU Cap/Com Register 3 Low */
#define ADDR_SCR_T2CCU_CC4L             0xc2    /* RMAP=0, PAGE= 3 - T2CCU Cap/Com Register 4 Low */
#define ADDR_SCR_T2CCU_CC5L             0xc3    /* RMAP=0, PAGE= 3 - T2CCU Cap/Com Register 5 Low */
#define ADDR_SCR_T2CCU_CC3H             0xc4    /* RMAP=0, PAGE= 3 - T2CCU Cap/Com Register 3 High */
#define ADDR_SCR_T2CCU_CC4H             0xc5    /* RMAP=0, PAGE= 3 - T2CCU Cap/Com Register 4 High */
#define ADDR_SCR_T2CCU_CC5H             0xc6    /* RMAP=0, PAGE= 3 - T2CCU Cap/Com Register 5 High */
#define ADDR_SCR_T2CCU_CCTDTCL          0xc2    /* RMAP=0, PAGE= 4 - T2CCU Cap/Com Timer Dead-Time Control Reg. Low */
#define ADDR_SCR_T2CCU_CCTDTCH          0xc3    /* RMAP=0, PAGE= 4 - T2CCU Cap/Com Timer Dead-Time Control Reg. High */
#define ADDR_SCR_ADCOMP_RES             0xfa    /* RMAP=0, PAGE= 0 - ADCOMP Result Register */
