Infineon/AURIX_code_examples/code_examples/iLLD_TC37x_ADS_SCR_Blinky_LED_LK_1/SCR/Libraries/registers.h
#define ADDR_SCR_ADCOMP_CON             0xfb    /* RMAP=0, PAGE= 0 - ADCOMP Control Register */

#define RMAP_NVM_STATUS1                0
#define RMAP_NVM_STATUS2                0
#define RMAP_NVM_ADDRP                  0
#define RMAP_NVM_ADDRS                  0
#define RMAP_NVM_CTRL                   0
#define RMAP_NVM_MODE                   0
#define RMAP_NVM_MAP1                   0
#define RMAP_NVM_MAP2                   0
#define RMAP_NVM_BRNG                   0
#define RMAP_NVM_PROT                   0
#define RMAP_NVM_SFRSEL                 0
#define RMAP_NVM_SFRDAT                 0
#define RMAP_SCR_P00_OUT                0
#define PAGE_SCR_P00_OUT                0
#define RMAP_SCR_P00_IN                 0
#define PAGE_SCR_P00_IN                 0
#define RMAP_SCR_P00_OMSR               0
#define PAGE_SCR_P00_OMSR               0
#define RMAP_SCR_P00_OMCR               0
#define PAGE_SCR_P00_OMCR               0
#define RMAP_SCR_P00_OMTR               0
#define PAGE_SCR_P00_OMTR               0
#define RMAP_SCR_P01_OUT                0
#define PAGE_SCR_P01_OUT                0
#define RMAP_SCR_P01_IN                 0
#define PAGE_SCR_P01_IN                 0
#define RMAP_SCR_P01_OMSR               0
#define PAGE_SCR_P01_OMSR               0
#define RMAP_SCR_P01_OMCR               0
#define PAGE_SCR_P01_OMCR               0
#define RMAP_SCR_P01_OMTR               0
#define PAGE_SCR_P01_OMTR               0
#define RMAP_SCR_WCAN_CFG               0
#define PAGE_SCR_WCAN_CFG               0
#define RMAP_SCR_WCAN_INTMRSLT          0
#define PAGE_SCR_WCAN_INTMRSLT          0
#define RMAP_SCR_WCAN_CDR_CTRL          0
#define PAGE_SCR_WCAN_CDR_CTRL          0
#define RMAP_SCR_WCAN_CDR_UPPER_CTRL    0
#define PAGE_SCR_WCAN_CDR_UPPER_CTRL    0
#define RMAP_SCR_WCAN_CDR_LOWER_CTRL    0
#define PAGE_SCR_WCAN_CDR_LOWER_CTRL    0
#define RMAP_SCR_WCAN_CDR_MEAS_HIGH     0
#define PAGE_SCR_WCAN_CDR_MEAS_HIGH     0
#define RMAP_SCR_WCAN_CDR_MEAS_LOW      0
#define PAGE_SCR_WCAN_CDR_MEAS_LOW      0
#define RMAP_SCR_WCAN_FD_CTRL           0
#define PAGE_SCR_WCAN_FD_CTRL           0
#define RMAP_SCR_T2_CON                 0
#define PAGE_SCR_T2_CON                 0
#define RMAP_SCR_T2_MOD                 0
#define PAGE_SCR_T2_MOD                 0
#define RMAP_SCR_T2_RC2L                0
#define PAGE_SCR_T2_RC2L                0
#define RMAP_SCR_T2_RC2H                0
#define PAGE_SCR_T2_RC2H                0
#define RMAP_SCR_T2_T2L                 0
#define PAGE_SCR_T2_T2L                 0
#define RMAP_SCR_T2_T2H                 0
#define PAGE_SCR_T2_T2H                 0
#define RMAP_SCR_T2_CON1                0
#define PAGE_SCR_T2_CON1                0
#define RMAP_SCR_IRCON0                 0
#define PAGE_SCR_IRCON0                 0
#define RMAP_SCR_IRCON1                 0
#define PAGE_SCR_IRCON1                 0
#define RMAP_SCR_IRCON2                 0
#define PAGE_SCR_IRCON2                 0
#define RMAP_SCR_SCRINTEXCHG            0
#define PAGE_SCR_SCRINTEXCHG            0
#define RMAP_SCR_TCINTEXCHG             0
#define PAGE_SCR_TCINTEXCHG             0
#define RMAP_SCR_SCU_RSTST              0
#define PAGE_SCR_SCU_RSTST              0
#define RMAP_SCR_SCU_MRSTST             0
#define PAGE_SCR_SCU_MRSTST             0
#define RMAP_SCR_SCU_SR                 0
#define PAGE_SCR_SCU_SR                 0
#define RMAP_SCR_ADCOMP_RES             0
#define PAGE_SCR_ADCOMP_RES             0
#define RMAP_SCR_ADCOMP_CON             0
#define PAGE_SCR_ADCOMP_CON             0
#define RMAP_SCR_WDT_CON                0
#define RMAP_SCR_WDT_REL                0
#define RMAP_SCR_WDT_WINB               0
#define RMAP_SCR_WDT_L                  0
#define RMAP_SCR_WDT_H                  0
#define RMAP_SCR_SSC_CONOL              0
#define RMAP_SCR_SSC_CONPL              0
#define RMAP_SCR_SSC_CONPH              0
#define RMAP_SCR_SSC_CONOH              0
#define RMAP_SCR_SSC_TBL                0
#define RMAP_SCR_SSC_RBL                0
#define RMAP_SCR_SSC_BRL                0
#define RMAP_SCR_SSC_BRH                0
#define RMAP_SCR_IO_PAGE                0
#define RMAP_SCR_WCAN_PAGE              0
#define RMAP_SCR_UART_SCON              0
#define RMAP_SCR_UART_SBUF              0
#define RMAP_SCR_UART_BGL               0
#define RMAP_SCR_UART_BCON              0
#define RMAP_SCR_UART_LINST             0
#define RMAP_SCR_UART_BGH               0
#define RMAP_SCR_T2CCU_PAGE             0
#define RMAP_SCR_RTC_CON                0
#define RMAP_SCR_RTC_CNT0               0
#define RMAP_SCR_RTC_CNT1               0
#define RMAP_SCR_RTC_CNT2               0
#define RMAP_SCR_RTC_CNT3               0
#define RMAP_SCR_RTC_CR0                0
#define RMAP_SCR_RTC_CR1                0
#define RMAP_SCR_RTC_CR2                0
#define RMAP_SCR_RTC_CR3                0
#define RMAP_SCR_SCU_PAGE               0
#define RMAP_SCR_DBG_MMCR               1
#define RMAP_SCR_DBG_MMCR2              1
#define RMAP_SCR_DBG_MMSR               1
#define RMAP_SCR_DBG_MMBPCR             1
#define RMAP_SCR_DBG_MMICR              1
#define RMAP_SCR_DBG_MMDR               1
#define RMAP_SCR_DBG_HWBPSR             1
#define RMAP_SCR_DBG_HWBPDR             1
#define RMAP_SCR_DBG_MMWR1              1
#define RMAP_SCR_DBG_MMWR2              1
#define RMAP_SCR_P00_IOCR0              0
#define PAGE_SCR_P00_IOCR0              1
#define RMAP_SCR_P00_IOCR1              0
#define PAGE_SCR_P00_IOCR1              1
#define RMAP_SCR_P00_IOCR2              0
#define PAGE_SCR_P00_IOCR2              1
#define RMAP_SCR_P00_IOCR3              0
#define PAGE_SCR_P00_IOCR3              1
#define RMAP_SCR_P00_IOCR4              0
#define PAGE_SCR_P00_IOCR4              1
#define RMAP_SCR_P00_IOCR5              0
#define PAGE_SCR_P00_IOCR5              1
#define RMAP_SCR_P00_IOCR6              0
#define PAGE_SCR_P00_IOCR6              1
#define RMAP_SCR_P00_IOCR7              0
#define PAGE_SCR_P00_IOCR7              1
#define RMAP_SCR_P01_IOCR0              0
#define PAGE_SCR_P01_IOCR0              1
#define RMAP_SCR_P01_IOCR1              0
#define PAGE_SCR_P01_IOCR1              1
#define RMAP_SCR_P01_IOCR2              0
#define PAGE_SCR_P01_IOCR2              1
#define RMAP_SCR_P01_IOCR3              0
#define PAGE_SCR_P01_IOCR3              1
#define RMAP_SCR_P01_IOCR4              0
#define PAGE_SCR_P01_IOCR4              1
#define RMAP_SCR_P01_IOCR5              0
#define PAGE_SCR_P01_IOCR5              1
#define RMAP_SCR_P01_IOCR6              0
#define PAGE_SCR_P01_IOCR6              1
#define RMAP_SCR_P01_IOCR7              0
#define PAGE_SCR_P01_IOCR7              1
#define RMAP_SCR_WCAN_INTESTAT0         0
#define PAGE_SCR_WCAN_INTESTAT0         1
#define RMAP_SCR_WCAN_INTESTAT1         0
#define PAGE_SCR_WCAN_INTESTAT1         1
#define RMAP_SCR_WCAN_FRMERRCNT         0
#define PAGE_SCR_WCAN_FRMERRCNT         1
#define RMAP_SCR_WCAN_INTESCLR0         0
#define PAGE_SCR_WCAN_INTESCLR0         1
#define RMAP_SCR_WCAN_INTESCLR1         0
#define PAGE_SCR_WCAN_INTESCLR1         1
#define RMAP_SCR_WCAN_BTL1_CTRL         0
#define PAGE_SCR_WCAN_BTL1_CTRL         1
#define RMAP_SCR_WCAN_BTL2_CTRL         0
#define PAGE_SCR_WCAN_BTL2_CTRL         1
#define RMAP_SCR_WCAN_DLC_CTRL          0
#define PAGE_SCR_WCAN_DLC_CTRL          1
#define RMAP_SCR_T2CCU_CCEN             0
#define PAGE_SCR_T2CCU_CCEN             1
#define RMAP_SCR_T2CCU_CCTBSEL          0
#define PAGE_SCR_T2CCU_CCTBSEL          1
#define RMAP_SCR_T2CCU_CCTRELL          0
#define PAGE_SCR_T2CCU_CCTRELL          1
#define RMAP_SCR_T2CCU_CCTRELH          0
#define PAGE_SCR_T2CCU_CCTRELH          1
#define RMAP_SCR_T2CCU_CCTL             0
#define PAGE_SCR_T2CCU_CCTL             1
#define RMAP_SCR_T2CCU_CCTH             0
#define PAGE_SCR_T2CCU_CCTH             1
#define RMAP_SCR_T2CCU_CCTCON           0
#define PAGE_SCR_T2CCU_CCTCON           1
#define RMAP_SCR_NMISR                  0
#define PAGE_SCR_NMISR                  1
#define RMAP_SCR_NMICON                 0
#define PAGE_SCR_NMICON                 1
#define RMAP_SCR_EXICON0                0
#define PAGE_SCR_EXICON0                1
#define RMAP_SCR_EXICON1                0
#define PAGE_SCR_EXICON1                1
#define RMAP_SCR_EXICON2                0
#define PAGE_SCR_EXICON2                1
#define RMAP_SCR_EXICON3                0
#define PAGE_SCR_EXICON3                1
#define RMAP_SCR_SCU_MODIEN             0
#define PAGE_SCR_SCU_MODIEN             1
#define RMAP_SCR_SCU_RSTCON             0
#define PAGE_SCR_SCU_RSTCON             1
#define RMAP_SCR_SCU_CMCON              0
#define PAGE_SCR_SCU_CMCON              1
#define RMAP_SCR_SCU_PMCON1             0
#define PAGE_SCR_SCU_PMCON1             1
#define RMAP_SCR_SCU_STDBYWKP           0
#define PAGE_SCR_SCU_STDBYWKP           1
#define RMAP_SCR_EVRADCSTAT0            0
#define PAGE_SCR_EVRADCSTAT0            1
#define RMAP_SCR_EVRADCSTAT1            0
#define PAGE_SCR_EVRADCSTAT1            1
#define RMAP_SCR_EVRADCSTAT2            0
#define PAGE_SCR_EVRADCSTAT2            1
#define RMAP_SCR_P00_PDR0               0
#define PAGE_SCR_P00_PDR0               2
#define RMAP_SCR_P00_PDR2               0
#define PAGE_SCR_P00_PDR2               2
#define RMAP_SCR_P00_PDR4               0
#define PAGE_SCR_P00_PDR4               2
#define RMAP_SCR_P00_PDR6               0
#define PAGE_SCR_P00_PDR6               2
#define RMAP_SCR_P00_PDISC              0
#define PAGE_SCR_P00_PDISC              2
#define RMAP_SCR_P01_PDR0               0
#define PAGE_SCR_P01_PDR0               2
#define RMAP_SCR_P01_PDR2               0
#define PAGE_SCR_P01_PDR2               2
#define RMAP_SCR_P01_PDR4               0
#define PAGE_SCR_P01_PDR4               2
#define RMAP_SCR_P01_PDR6               0
#define PAGE_SCR_P01_PDR6               2
#define RMAP_SCR_P01_PDISC              0
#define PAGE_SCR_P01_PDISC              2
#define RMAP_SCR_WCAN_ID0_CTRL          0
#define PAGE_SCR_WCAN_ID0_CTRL          2
#define RMAP_SCR_WCAN_ID1_CTRL          0
#define PAGE_SCR_WCAN_ID1_CTRL          2
#define RMAP_SCR_WCAN_ID2_CTRL          0
#define PAGE_SCR_WCAN_ID2_CTRL          2
#define RMAP_SCR_WCAN_ID3_CTRL          0
#define PAGE_SCR_WCAN_ID3_CTRL          2
#define RMAP_SCR_WCAN_MASK_ID0_CTRL     0
#define PAGE_SCR_WCAN_MASK_ID0_CTRL     2
#define RMAP_SCR_WCAN_MASK_ID1_CTRL     0
#define PAGE_SCR_WCAN_MASK_ID1_CTRL     2
#define RMAP_SCR_WCAN_MASK_ID2_CTRL     0
#define PAGE_SCR_WCAN_MASK_ID2_CTRL     2
#define RMAP_SCR_WCAN_MASK_ID3_CTRL     0
#define PAGE_SCR_WCAN_MASK_ID3_CTRL     2
#define RMAP_SCR_T2CCU_COSHDW           0
#define PAGE_SCR_T2CCU_COSHDW           2
#define RMAP_SCR_T2CCU_CC0L             0
#define PAGE_SCR_T2CCU_CC0L             2
#define RMAP_SCR_T2CCU_CC1L             0
#define PAGE_SCR_T2CCU_CC1L             2
#define RMAP_SCR_T2CCU_CC2L             0
#define PAGE_SCR_T2CCU_CC2L             2
#define RMAP_SCR_T2CCU_CC0H             0
#define PAGE_SCR_T2CCU_CC0H             2
#define RMAP_SCR_T2CCU_CC1H             0
#define PAGE_SCR_T2CCU_CC1H             2
#define RMAP_SCR_T2CCU_CC2H             0
#define PAGE_SCR_T2CCU_CC2H             2
#define RMAP_SCR_MODPISEL0              0
#define PAGE_SCR_MODPISEL0              2
#define RMAP_SCR_MODPISEL1              0
#define PAGE_SCR_MODPISEL1              2
#define RMAP_SCR_MODPISEL2              0
#define PAGE_SCR_MODPISEL2              2
#define RMAP_SCR_MODPISEL3              0
#define PAGE_SCR_MODPISEL3              2
#define RMAP_SCR_MODPISEL4              0
#define PAGE_SCR_MODPISEL4              2
#define RMAP_SCR_MODPISEL5              0
#define PAGE_SCR_MODPISEL5              2
#define RMAP_SCR_SCR_HWCFG              0
#define PAGE_SCR_SCR_HWCFG              2
#define RMAP_SCR_DBG_MODSUSP            0
#define PAGE_SCR_DBG_MODSUSP            2
#define RMAP_SCR_WCAN_DATA0_CTRL        0
#define PAGE_SCR_WCAN_DATA0_CTRL        3
#define RMAP_SCR_WCAN_DATA1_CTRL        0
#define PAGE_SCR_WCAN_DATA1_CTRL        3
#define RMAP_SCR_WCAN_DATA2_CTRL        0
#define PAGE_SCR_WCAN_DATA2_CTRL        3
#define RMAP_SCR_WCAN_DATA3_CTRL        0
#define PAGE_SCR_WCAN_DATA3_CTRL        3
#define RMAP_SCR_WCAN_DATA4_CTRL        0
#define PAGE_SCR_WCAN_DATA4_CTRL        3
#define RMAP_SCR_WCAN_DATA5_CTRL        0
#define PAGE_SCR_WCAN_DATA5_CTRL        3
#define RMAP_SCR_WCAN_DATA6_CTRL        0
#define PAGE_SCR_WCAN_DATA6_CTRL        3
#define RMAP_SCR_WCAN_DATA7_CTRL        0
#define PAGE_SCR_WCAN_DATA7_CTRL        3
#define RMAP_SCR_T2CCU_COCON            0
#define PAGE_SCR_T2CCU_COCON            3
#define RMAP_SCR_T2CCU_CC3L             0
#define PAGE_SCR_T2CCU_CC3L             3
#define RMAP_SCR_T2CCU_CC4L             0
#define PAGE_SCR_T2CCU_CC4L             3
#define RMAP_SCR_T2CCU_CC5L             0
#define PAGE_SCR_T2CCU_CC5L             3
#define RMAP_SCR_T2CCU_CC3H             0
#define PAGE_SCR_T2CCU_CC3H             3
#define RMAP_SCR_T2CCU_CC4H             0
#define PAGE_SCR_T2CCU_CC4H             3
#define RMAP_SCR_T2CCU_CC5H             0
#define PAGE_SCR_T2CCU_CC5H             3
#define RMAP_SCR_T2CCU_CCTDTCL          0
#define PAGE_SCR_T2CCU_CCTDTCL          4
#define RMAP_SCR_T2CCU_CCTDTCH          0
#define PAGE_SCR_T2CCU_CCTDTCH          4

#define SCR_ADCOMP_CON SFR(ADDR_SCR_ADCOMP_CON)

#endif /* REGISTERS_H */
